# necessary brew housekeeping
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
brew "mas"

# general usage

## browsing
cask "brave-browser"

## password management
cask "1password"
mas "1Password for Safari", id: 1333542190

## gaming
cask "discord"
cask "steam"

## window management
cask "contexts"

## chatting
cask "signal"
cask "slack"
cask "telegram"

## keyboard customization
cask "karabiner-elements"
brew "yqrashawn/goku/goku" # helps with karabiner config

## home dir management
brew "chezmoi"

## networking
cask "tailscale"

## terminals
cask "kitty"
cask "wezterm"

## shells
brew "fish"
brew "fisher"
brew "nushell"

# cli tooling
brew "fzf"
brew "ripgrep"
brew "fd"
brew "thefuck"
brew "tldr"
brew "zoxide"
brew "just"
brew "broot"
brew "bat"
brew "direnv"

## terminal multiplexing
brew "zellij"

# coding
## editors
brew "neovim"
brew "helix"
tap "railwaycat/emacsmacport"
cask "railwaycat/emacsmacport/emacs-mac"
cask "visual-studio-code"
cask "sublime-text"

## version control
brew "git"
brew "gh"
brew "lazygit"
cask "fork"
cask "sublime-merge"

## db
cask "beekeeper-studio"

## containers
cask "lens"
cask "docker"
brew "k9s"

## api tooling
cask "bruno"

cask "dropbox"
cask "font-hack-nerd-font"
cask "monitorcontrol"
cask "protonmail-bridge"
cask "stats"
cask "devutils"
mas "Hush Nag Blocker", id: 1544743900

