tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

brew "asdf"
# brew "autojump"
brew "bat"
brew "chezmoi"
brew "direnv"
brew "fish"
brew "fisher"
brew "gh"
brew "git"
brew "neovim"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "vim"
brew "yqrashawn/goku/goku"
brew "mas"
brew "k9s"
brew "fzf"

brew "nushell"
brew "zellij"
brew "zoxide"
brew "just"

cask "1password"
cask "alfred"
cask "cloudflare-warp"
cask "discord"
cask "dropbox"
cask "firefox-developer-edition"
cask "font-meslo-lg-nerd-font"
cask "font-hack-nerd-font"
cask "insomnia"
cask "lens"
cask "postico"
cask "signal"
cask "sequel-pro-nightly"
cask "slack"
cask "steam"
cask "sublime-merge"
cask "sublime-text"
cask "telegram"
cask "visual-studio-code"
cask "protonvpn"
cask "brave-browser"
cask "kitty"
cask "docker"
cask "karabiner-elements"
# cask "zerotier-one" # trying out tailscale
cask "cmake"
# cask "warp" # not yet on brew?

cask "stats"

mas "1Password for Safari", id: 1333542190
mas "Tailscale", id: 1475387142
mas "Hush Nag Blocker", id: 1544743900

# emacs
tap "railwaycat/emacsmacport"
cask "railwaycat/emacsmacport/emacs-mac"

